app/controllers/application_controller.rb

    def current_user_name
        User.find_by(id: session[:user_id]).name
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]