app/controllers/stocks_controller.rb

    def index
        @alphvantagekey = "CVNQRSCEWDQL2YVF"
        @client = Alphavantage::Client.new key: @alphavantagekey
        @newsapi = News.new("3651a3e5ac674c158be991a8076cf34a")
        @stocks = Stock.all
---
SELECT "stocks".* FROM "stocks"

    def show
        @alphavantagekey = "CVNQRSCEWDQL2YVF"
        @client = Alphavantage::Client.new key: @alphavantagekey
        @newsapi = News.new("3651a3e5ac674c158be991a8076cf34a")
        #@all_articles = @newsapi.get_everything(q: "bitcoin" ,sources: 'bbc-news,the-verge',domains: 'bbc.co.uk,techcrunch.com',from: '2021-03-30',to: '2021-04-1',language: 'en',sortBy: 'relevancy', page: 1)
        #@top_headlines = @newsapi.get_top_headlines(q: 'apple', sources: 'bbc-news,the-verge', category: 'business', language: 'en', country: 'us')

        stock_id = params[:id]
        @stock = Stock.find_by(id: stock_id)
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        name = params[:stock][:name]
        ticker = params[:stock][:ticker]
        Stock.create(name: name, ticker: ticker)
---
INSERT INTO "stocks" ("name", "ticker") VALUES (?, ?)  [["name", "Nio"], ["ticker", "NIO"]]

    def edit
        stock_id = params[:id]
        @stock = Stock.find_by(id: stock_id)
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def update
        stock_id = params[:id]
        @stock = Stock.find_by(id: stock_id)

        name = params[:stock][:name]
        ticker = params[:stock][:ticker]

        @stock.update(name: name, ticker: ticker)
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "stocks" SET "name" = ?, "ticker" = ? WHERE "stocks"."id" = ?  [["name", "Spotify"], ["ticker", "SPOT"], ["id", 6]]

    def destroy
        @stock = Stock.find(params[:id])
        @stock.destroy
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 6]]