app/controllers/users_controller.rb

INSERT INTO "users" ("name") VALUES (?)  [["name", "joe"]]
---
    def create
        name = params[:user][:name]
        user = User.create(name: name)